html/express.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-02 Sat 21:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org64a1d9a">1. Initialization</a></li>
<li><a href="#orgb0805c2">2. Install Express</a></li>
<li><a href="#orgeca95e5">3. Basic Express app</a></li>
<li><a href="#org8cf3375">4. Routing</a>
<ul>
<li><a href="#orgc46f261">4.1. HTTP Methods</a></li>
<li><a href="#orge43b8aa">4.2. Express.Router</a></li>
</ul>
</li>
<li><a href="#org63b8b28">5. Parting thoughts</a>
<ul>
<li><a href="#org54bf8c8">5.1. Express overloads a lot of functions</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org64a1d9a" class="outline-2">
<h2 id="org64a1d9a"><span class="section-number-2">1</span> Initialization</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-bash">mkdir express-blog
<span style="color: #DCDCCC; font-weight: bold;">cd</span> express-blog
npm init
</pre>
</div>

<p>
Check that package.json is created, with proper details.
</p>
</div>
</div>
<div id="outline-container-orgb0805c2" class="outline-2">
<h2 id="orgb0805c2"><span class="section-number-2">2</span> Install Express</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-bash">npm install express --save
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeca95e5" class="outline-2">
<h2 id="orgeca95e5"><span class="section-number-2">3</span> Basic Express app</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">index.js</span>

<span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">express</span> = require(<span style="color: #CC9393;">'express'</span>);
<span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">app</span> = express();

app.get(<span style="color: #CC9393;">'/'</span>, <span style="color: #F0DFAF; font-weight: bold;">function</span>(<span style="color: #DFAF8F;">req</span>, <span style="color: #DFAF8F;">res</span>) {
  res.send(<span style="color: #CC9393;">'Hello World!'</span>);
})

app.listen(3000, <span style="color: #F0DFAF; font-weight: bold;">function</span>() {
  console.log(<span style="color: #CC9393;">"example app listening on port 3000"</span>);
})
</pre>
</div>
</div>
</div>
<div id="outline-container-org8cf3375" class="outline-2">
<h2 id="org8cf3375"><span class="section-number-2">4</span> Routing</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgc46f261" class="outline-3">
<h3 id="orgc46f261"><span class="section-number-3">4.1</span> HTTP Methods</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>GET, POST, PUT, DELETE</li>
<li>String, regex route matching (quotes, no quotes)</li>
</ul>
</div>
</div>
<div id="outline-container-orge43b8aa" class="outline-3">
<h3 id="orge43b8aa"><span class="section-number-3">4.2</span> Express.Router</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #5F7F5F;">//  </span><span style="color: #7F9F7F;">/routes/hi.js</span>
<span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">router</span> = express.Router();

router.get(<span style="color: #CC9393;">'/hello'</span>, <span style="color: #F0DFAF; font-weight: bold;">function</span>(<span style="color: #DFAF8F;">req</span>, <span style="color: #DFAF8F;">res</span>) {
  res.send(<span style="color: #CC9393;">"hello"</span>);
})

router.get(<span style="color: #CC9393;">'/there'</span> <span style="color: #F0DFAF; font-weight: bold;">function</span>(<span style="color: #DFAF8F;">req</span>, <span style="color: #DFAF8F;">res</span>) {
  res.send(<span style="color: #CC9393;">"there"</span>);
})

module.exports = router;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">index.js</span>
<span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">hiRoutes</span> = require(<span style="color: #CC9393;">'./routes/hi'</span>);

app.use(<span style="color: #CC9393;">'/hi'</span>, hiRoutes);
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org63b8b28" class="outline-2">
<h2 id="org63b8b28"><span class="section-number-2">5</span> Parting thoughts</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org54bf8c8" class="outline-3">
<h3 id="org54bf8c8"><span class="section-number-3">5.1</span> Express overloads a lot of functions</h3>
<div class="outline-text-3" id="text-5-1">
<p>
app.get() for routing, and setting app settings
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2017-12-02 Sat 21:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
